#[Python] 双色球大乐透等彩票随机生成

# coding:utf-8

import random

# 每次执行程序清空txt文件：
f = open('双色球中奖号码.txt', 'w', encoding='utf-8')
print('福彩双色球 ：\n-------------------------[***************红 球***************] [蓝 球]', file=f)
f.close()

num = 0
s_num = 1
i = input('请输入要随机的次数：')
while num < int(i):
    red = random.sample(['01', '02', '03', '04', '05', '06', '07', '08', '09', '10',
                         '11', '12', '13', '14', '15', '16', '17', '18', '19', '20',
                         '21', '22', '23', '24', '25', '26', '27', '28', '29', '30',
                         '31', '32', '33'], 6)
    blue = random.sample(['01', '02', '03', '04', '05', '06', '07', '08',
                          '09', '10', '11', '12', '13', '14', '15', '16'], 1)
    data = open('双色球中奖号码.txt', 'a+', encoding='utf-8')
    print('恭喜爸爸中奖：第', s_num, '组号码-->', red, blue, file=data)
    data.close()
    s_num += 1
    num += 1